a = "Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!"

print ('Шаг 1 - Количество символов - '  + str(len(a)))

print ('Шаг 2 - Развернуть строку - ' + "   Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!" [::-1])

print ('Шаг 3 - Сделать каждое слово с большой буквы - ' + a.title())

print ('Шаг 4 - Сделать весь текст прописными буквами - ' + a.lower())

print ('Шаг 5 - Количество символов нд - ',  a.count('нд'))

print ('Шаг 6 - Количество символов ам - ',  a.count('ам'))

print ('Шаг 7 - Количество символов о - ',  a.count('о'))

print ('Шаг 8 - Заменить символ а на 22 - ',  a.replace('а', '22'))

print ('Шаг 9 - Оставить заглавную только первыю букву - ' + a.capitalize())

print ('\nСпасибо за внимание!')