a = "Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!"

print ('Шаг 1 - Количество символов - '  + str(len(a)))

print ('Шаг 2 - Развернуть строку - ' + "   Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!" [::-1])

print ('Шаг 3 - Сделать каждое слово с большой буквы - ' + a.title())

print ('Шаг 4 - Сделать весь текст прописными буквами - ' + a.lower())

print ('22')
print ('22')